// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

/*Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, 
в которой все заглавные буквы заменены на строчные.
*/
/*
string text = "ShivoroT na VivOroT";
            string newtext = text.ToUpper();
            MessageBox.Show(newtext);
            */



/*Задача 3: Задайте произвольную строку. Выясните, является ли она палиндромом.*/

/* using System;
namespace Palindrom
{
    class Program
    {
        static void Main(string[] args)
        {
            char[] arr = { 'p', 'a', 's', 'a', 'p'};
            if (IsPalindrom(arr))
                Console.WriteLine("АгА");
            else
                Console.WriteLine("Неа");
        }
 
/* Задача 4*(не обязательная): Задайте строку, состоящую из слов, разделенных пробелами. 
Сформировать строку, в которой слова расположены в обратном порядке. В полученной 
строке слова должны быть также разделены пробелами.

strint stt=Hi my lenght world";
for (int i=mas.Length-1; i>=0; i--)
  str+=mas[i]+"Hi my lenght world";

  */
