// See https://aka.ms/new-console-template for more information
// Console.WriteLine("Hello, World!");

/*Задача 2: Задайте строку, содержащую латинские буквы в обоих регистрах. Сформируйте строку, 
в которой все заглавные буквы заменены на строчные.
*/
/*
string text = "ShivoroT na VivOroT";
            string newtext = text.ToUpper();
            MessageBox.Show(newtext);
            */



/*Задача 3: Задайте произвольную строку. Выясните, является ли она палиндромом.*/

/* using System;
namespace Palindrom
{
    class Program
    {
        static void Main(string[] args)
        {
            char[] arr = { 'p', 'a', 's', 'a', 'p'};
            if (IsPalindrom(arr))
                Console.WriteLine("АгА");
            else
                Console.WriteLine("Неа");
        }
 
